text = <<TEXT
I love Ruby.
Python is a great language.
Java and JavaScript are different.
TEXT

puts text.scan(/[A-Z][A-Za-z]+/)

text_2 = <<TEXT
私の郵便番号は1234567です。
僕の住所は6770056 兵庫県西協市板波町1234だよ。　
TEXT

puts text_2.gsub(/(\d{3})(\d{4})/) {"#{$1}-#{$2}"}

puts '<--------------------------------------------------------------------------------------------------------------->'

r = /(\d{3})(\d{4})/
puts r.class

p '123-4567' =~ r
p '1234567' =~ r

p '123-4567' !~ r
p '1234567' !~ r

puts '<--------------------------------------------------------------------------------------------------------------->'

text_3 = '私の誕生日は1999年9月25日です'

# @type [MatchData] m
m = /(\d+)年(\d+)月(\d+)日/.match(text_3)
p m
p m[0], m[1], m[2], m[3]

puts '<--------------------------------------------------------------------------------------------------------------->'

m_2 = /(?<year>\d+)年(?<month>\d+)月(?<day>\d+)日/.match(text_3)
p m_2[:year], m_2[:month], m_2[:day]

puts '<--------------------------------------------------------------------------------------------------------------->'

text_3 =~ /(\d+)年(\d+)月(\d+)日/
p $~, $1, $2, $3

puts '<--------------------------------------------------------------------------------------------------------------->'

# scan
p '123 456 789'.scan(/\d+/)

# [], slice
text_5 = '私の郵便番号は123-4567です'
p text_5[/(\d{3})-(\d{4})/]
p text_5.slice(/(\d{3})-(\d{4})/)

text_6 = '私の誕生日は1999年9月25日です'
p text_6[/(\d+)年(\d+)月(\d+)日/, 1]
p text_6.slice(/(\d+)年(\d+)月(\d+)日/, 3)

# split
text_7 = 'java,php,ruby'
p text_7.split(',')

# gsub
text_8 = 'java,php,ruby!'
p text_8.gsub(',', '+')

text_9 = '私の誕生日は1999年9月25日です'
text_9.gsub(/(\d+)年(\d+)月(\d+)日/) do
  puts "#{$1}-#{$2}-#{$3}"
end
